[
    {
        "name": "Sam's Big Adventure",
        "image": "img/samsBigAdventure/samImages.jpg",
        "cols": 9,
        "icon": "img/samsBigAdventure/icon.jpg",
        "story": [
            {"text": "Sam loved to walk. He liked hearing the birds sing and feeling the wind on his face.<br>One sunny day, he walked so far that he found a big, green forest. The trees were so tall they tickled the clouds.<br>Suddenly, two little creatures appeared!<br>Chipper the squirrel waved his fluffy tail.<br>“Hi there! Follow me! I’ll teach you how to climb a tree!” he squeaked.<br>Aaron the groundhog popped out of a hole and said,<br>“Don’t climb trees! Come see my home underground. It’s warm and cozy!”<br>", "transitions": [{"text": "Go with Chipper", "transition": 2}, {"text": "Go with Aaron", "transition": 7}, {"text": "Go with Chipper and Aaron", "transition": 11}]},
            {"text": "Sam followed Chipper and started to climb the big oak tree.<br>“Hold on tight!” Chipper called. “Use your feet, not just your hands!”<br>When Sam reached the top, the forest spread out like a green ocean.<br>He could see his house far away!<br>“Look there!” said Chipper. “A bird’s nest! Do you want to peek inside?”<br>", "transitions": [{"text": "Look inside the nest", "transition": 3}, {"text": "Climb down", "transition": 6}]},
            {"text": "Sam crept closer and peeked into the nest.<br>Inside were three tiny, blue eggs. “They look like little sky marbles,” he whispered.<br>Then—whoosh!—a mama bird flew back!<br>“Chirp! Chirp!” she cried, flapping her wings.<br>", "transitions": [{"text": "Say sorry and climb down", "transition": 4}, {"text": "Try to talk to the bird", "transition": 5}]},
            {"text": "“I’m sorry, little bird,” Sam said softly.<br>The bird blinked and chirped again, but not angrily this time.<br>Chipper handed him a shiny acorn. “For being kind,” he said.<br>The moss beneath their feet glowed faintly as if approving his choice.<br>Sam realized he was really hot.<br>", "transitions": [{"text": "Go under a tree", "transition": 47}, {"text": "Go for a swim", "transition": 68}]},
            {"text": "“Hello,” Sam said. “I didn’t mean to scare you.”<br>The bird fluttered her wings and dropped a soft feather at his feet.<br>“Wow!” said Sam. “She gave me a gift!”<br>Sunlight danced on the feather, making rainbow patterns on the ground.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 1},
            {"text": "Sam shook his head. “I don’t want to bother the birds.”<br>“Good choice!” said Chipper. “Let’s find something yummy instead!”<br>They climbed down and shared berries from a bush.<br>", "transitions": [{"text": "Go home", "transition": 48}, {"text": "Keep exploring", "transition": 23}, {"text": "Wait for rain", "transition": 45}]},
            {"text": "Sam decided to visit Aaron’s home.<br>Aaron led him through tall grass to a cave under a tree root.<br>Inside, it was warm and smelled like dirt and pine needles.<br>“I’ll grab some water,” said Aaron. “Make yourself comfy!”<br>Sam looked around at the tiny twig chairs.<br>Then he turned—and the door had closed!<br>", "transitions": [{"text": "Look for an exit", "transition": 8}, {"text": "Call for Aaron", "transition": 9}, {"text": "Wait", "transition": 10}]},
            {"text": "Sam ran his fingers along the wall and found a small tunnel.<br>", "transitions": [{"text": "Crawl through it", "transition": 43}, {"text": "Stay in the cave", "transition": 9}]},
            {"text": "Sam knocked on the door. “Aaron? Are you there?”<br>The door opened, and Aaron smiled. “Sorry! It got stuck.”<br>He handed Sam some cool water, and they laughed together.<br>The shadows in the cave seemed to retreat as laughter filled the room.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 2},
            {"text": "Sam sat down on a mossy rug.<br>He heard soft snoring—Aaron had fallen asleep!<br>Sam yawned and curled up, too.<br>Outside, the forest whispered gently, a lullaby of rustling leaves.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 3},
            {"text": "Sam followed Chipper and Aaron down a narrow trail that split into two tunnels.<br>The air was cool and smelled like pine needles.<br>One tunnel glowed with golden light, while the other was dark and echoed with dripping water.<br>Aaron twitched his nose. “The bright one leads to the heart of the forest.”<br>", "transitions": [{"text": "Take the bright tunnel", "transition": 12}, {"text": "Take the dark tunnel", "transition": 13}]},
            {"text": "The tunnel opened into a wide, sparkling chamber filled with roots that glowed like lanterns.<br>“Wow!” Sam whispered. “It’s beautiful!”<br>In the middle stood a small wooden box carved with forest symbols.<br>Chipper tilted his head. “Should we open it?”<br>", "transitions": [{"text": "Open the box", "transition": 14}, {"text": "Leave it alone", "transition": 15}]},
            {"text": "The dark tunnel grew colder and narrower.<br>Water dripped down the walls, and something small skittered ahead.<br>Sam crouched, shining his flashlight—two glowing eyes blinked back!<br>It was only a frog… or was it? The croak echoed like words: “Go back.”<br>", "transitions": [{"text": "Turn around", "transition": 16}, {"text": "Keep going", "transition": 17}]},
            {"text": "Sam slowly lifted the lid of the wooden box.<br>Inside was a single golden key resting on a bed of moss.<br>When he picked it up, the roots around them shimmered and pulsed.<br>Aaron whispered, “That’s the Forest Key. It opens paths meant to stay hidden.”<br>", "transitions": [{"text": "Use the key", "transition": 18}, {"text": "Pocket it and leave", "transition": 19}]},
            {"text": "Sam shook his head. “Let’s not touch it.”<br>Chipper nodded quickly. “Good idea. Forest boxes can be tricky.”<br>As they turned to leave, the lights in the roots dimmed one by one.<br>The tunnel behind them closed, sealing with soft earth.<br>They had no choice but to go deeper.<br>", "transitions": [{"text": "Keep going", "transition": 20}]},
            {"text": "Sam turned around, heart pounding.<br>The tunnel walls seemed closer now, whispering softly in the dark.<br>When he finally crawled out, sunlight felt like a miracle.<br>Aaron laughed. “Guess that tunnel didn’t like visitors!”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 4},
            {"text": "Sam kept crawling until the tunnel opened into a crystal cave.<br>Glittering gems reflected his flashlight, painting the walls in rainbow colors.<br>He touched one—and it sang!<br>A low, humming note filled the air, and suddenly the cave trembled.<br>", "transitions": [{"text": "Run", "transition": 21}, {"text": "Stay to listen", "transition": 22}]},
            {"text": "Sam placed the key against a nearby root, and a door appeared!<br>Warm light spilled out, and a faint melody drifted through.<br>He stepped inside and found a treehouse filled with glowing books.<br>Each page whispered stories of forest adventures long forgotten.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 5},
            {"text": "Sam tucked the key into his pocket and smiled.<br>“I’ll save it for later,” he said.<br>As they left the chamber, the light behind them flickered, and the forest seemed to sigh.<br>Something told him the forest would remember him now.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 6},
            {"text": "The tunnel sloped downward until it opened into a moonlit cavern.<br>A pool of water shimmered in the center, glowing softly.<br>Chipper dipped his paw in and gasped. “It’s warm!”<br>Sam smiled. “A secret spring.” They sat beside it, resting as the forest sang above.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 7},
            {"text": "Sam ran as the crystal cave shook violently.<br>Rocks tumbled down, but he dove through the exit just in time.<br>Behind him, the entrance collapsed, sealing the strange song forever.<br>Aaron popped out of the ground nearby. “You made it!” he said, grinning.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 8},
            {"text": "Sam listened, mesmerized, as the humming turned gentle and calm.<br>The gems around him began to glow like a thousand stars.<br>When the song ended, he felt light and peaceful, as if he’d dreamed while awake.<br>He whispered, “Thank you,” and the cave whispered back, “Come again.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 9},
            {"text": "Sam and Chipper walked deeper into the forest, where the air grew cooler and damp.<br>A fog rolled in, wrapping around their ankles like soft blankets.<br>From somewhere ahead came a low humming, like bees—but slower, almost musical.<br>Chipper tilted his head. “That’s not normal forest sound…” he whispered.<br>", "transitions": [{"text": "Follow the humming", "transition": 24}, {"text": "Climb a tree to look around", "transition": 25}, {"text": "Run forward", "transition": 44}]},
            {"text": "The humming grew louder until Sam could make out glowing blue lights floating between the trees.<br>They weren’t bugs—each one looked like a tiny ball of mist.<br>When Sam reached out to touch one, it darted away, giggling faintly.<br>Suddenly, one floated close and whispered, “Stay with us forever.”<br>", "transitions": [{"text": "Run", "transition": 26}, {"text": "Stay to talk", "transition": 27}]},
            {"text": "Sam climbed a tall pine tree, the bark rough under his hands.<br>From above, he could see the mist forming shapes—faces that smiled and vanished.<br>In the distance, something sparkled near a pond.<br>Chipper called up, “I think I found something shiny!”<br>", "transitions": [{"text": "Climb down", "transition": 28}, {"text": "Stay to watch the mist", "transition": 29}]},
            {"text": "Sam turned and ran, heart pounding.<br>The blue lights followed him, whispering softly, “Don’t leave…”<br>He dove into a bush and covered his mouth, trying not to breathe too loud.<br>When he peeked out, the forest was quiet again—but he never forgot those voices.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 10},
            {"text": "Sam hesitated. “Who are you?” he asked.<br>The lights hovered closer, forming the shape of a tall, ghostly figure.<br>It smiled, gently touching his shoulder. “The forest remembers all who wander too deep.”<br>Chipper squeaked in terror and tugged Sam’s sleeve. They ran until the light faded.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 11},
            {"text": "Sam climbed down quickly and joined Chipper by the pond.<br>A beautiful golden ring lay half-buried in the mud.<br>When Sam picked it up, it shimmered and hummed softly.<br>“Maybe it’s magic,” said Chipper. “Or maybe it’s cursed.”<br>", "transitions": [{"text": "Put on the ring", "transition": 30}, {"text": "Throw it back", "transition": 31}]},
            {"text": "Sam stared at the mist as it twisted into patterns of stars and trees.<br>It whispered stories of lost travelers and old magic hidden in the soil.<br>He felt calm but strangely sleepy, his eyelids growing heavy.<br>When he woke, the mist and Chipper were gone—and the forest was silent.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 12},
            {"text": "Sam slipped the ring onto his finger.<br>At once, he felt lighter—like he could almost float.<br>Chipper’s eyes widened. “Sam! You’re glowing!”<br>Sam rose slowly into the air, laughing, as the forest shimmered with color.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 13},
            {"text": "Sam tossed the ring back into the pond.<br>The water rippled once, then went completely still.<br>“Smart,” said Chipper. “Magic things always come with trouble.”<br>They walked away, feeling proud and safe.<br>", "transitions": [{"text": "Keep walking", "transition": 32}]},
            {"text": "As the sun began to set, Sam and Chipper spotted an old bridge over a deep ravine.<br>It creaked with every gust of wind, and one of the ropes looked frayed.<br>“Should we cross?” asked Chipper.<br>Sam bit his lip. The shadows beneath looked endless.<br>", "transitions": [{"text": "Cross the bridge", "transition": 33}, {"text": "Search for another way", "transition": 35}]},
            {"text": "The bridge groaned under their feet.<br>Halfway across, a plank snapped, and Sam grabbed the rope to steady himself.<br>Chipper squeaked, “Don’t look down!”<br>Below, something moved—a long, dark shape swimming in the mist.<br>", "transitions": [{"text": "Rush forward", "transition": 34}, {"text": "Go back", "transition": 36}]},
            {"text": "Sam ran as fast as he could, the bridge swaying dangerously.<br>With a final leap, he made it to the other side.<br>The dark shape below rose up—a shadowy bird that screamed and vanished into the sky.<br>Chipper clapped his tiny paws. “You did it!”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 14},
            {"text": "Sam searched along the ravine and found a fallen tree forming a natural bridge.<br>It was sturdier, though mossy and slick.<br>They crossed carefully and reached a meadow filled with fireflies.<br>The moment they stepped in, all the fireflies spelled out his name.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 15},
            {"text": "Sam turned back, but the moment he stepped off the bridge, the rope snapped.<br>The bridge fell into the ravine with a thunderous crash.<br>He gasped, realizing how close he’d been to falling.<br>Chipper sighed in relief. “Guess we got lucky!”<br>", "transitions": [{"text": "Keep exploring", "transition": 37}, {"text": "Go home", "transition": 40}]},
            {"text": "After their close call, Sam noticed a trail lined with silver stones.<br>They glowed faintly under the twilight sky, leading deeper into the woods.<br>“Looks like someone left these here,” said Chipper.<br>", "transitions": [{"text": "Follow the stones", "transition": 38}, {"text": "Head home", "transition": 48}]},
            {"text": "The stones led them to a giant oak tree with a door carved into it.<br>Symbols glowed faintly on the bark, pulsing softly.<br>Chipper touched one, and the door creaked open.<br>Warm light spilled out, revealing shelves of glowing jars.<br>", "transitions": [{"text": "Enter the oak", "transition": 39}, {"text": "Run away", "transition": 41}]},
            {"text": "Inside the oak, hundreds of tiny lights floated in jars.<br>Each one flickered like a memory—some happy, some sad.<br>An old voice said, “Each light is a wish from a traveler.”<br>Sam placed a finger on one jar, and it glowed brighter.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 16},
            {"text": "Sam decided to head home, his adventure enough for one day.<br>The forest seemed to sigh softly as he left.<br>When he turned back once, the path behind him was gone.<br>He smiled anyway, knowing he’d found something special.<br>", "transitions": [{"text": "Don’t return", "transition": 67}, {"text": "Go back the next day", "transition": 65}, {"text": "Go back at night", "transition": 42}]},
            {"text": "Sam turned to run, but the forest around him shifted.<br>The door in the oak vanished, replaced by twisting roots.<br>Chipper grabbed his arm. “We have to move!”<br>They ran until dawn, never looking back.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 17},
            {"text": "The next day, Sam returned to the forest with a lantern.<br>He wanted to see if the glowing stones were still there.<br>But when he reached the clearing, the ground was smooth and untouched.<br>Only a single silver pebble remained, shaped like a tiny heart.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 18},
            {"text": "Sam squeezed out of the cave into a field of mushrooms that hummed when the wind blew.<br>Each one emitted a soft note, creating strange music.<br>Sam smiled, tapping a rhythm with his finger.<br>The forest seemed to sing with them.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 19},
            {"text": "Sam tripped over a vine that slithered like a snake.<br>Before he could move, it wrapped around his ankle!<br>He pulled hard, breaking free and falling into soft moss.<br>When he looked back, the vine was still, as if pretending to be normal again.<br>", "transitions": [{"text": "Go home", "transition": 40}, {"text": "Keep walking", "transition": 59}]},
            {"text": "A light rain began to fall, making everything sparkle.<br>Sam laughed and danced while Chipper hid under a leaf.<br>“Come on!” Sam giggled. “It’s just water!”<br>A rainbow curved across the trees, ending somewhere deep in the forest.<br>", "transitions": [{"text": "Follow the rainbow", "transition": 46}, {"text": "Hide under a tree", "transition": 47}]},
            {"text": "The rainbow seemed to point toward something glowing faintly in the distance.<br>“Should we follow it?” asked Chipper.<br>Sam grinned. “Of course.”<br>Together they ran toward it, vanishing into a shimmer of colors.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 20},
            {"text": "Sam runs under a tree.<br>He finds an abandoned birdhouse swaying from a branch.<br>He peeked inside and found a folded note.<br>It read, “The forest sees kindness.”<br>He smiled and tucked it into his pocket.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 21},
            {"text": "The next morning, Sam returned to the forest.<br>A soft mist drifted between the trees, and birds called faintly in the distance.<br>He noticed a small wooden sign that hadn’t been there before.<br>It read: “Welcome Back, Sam.”<br>", "transitions": [{"text": "Follow the sign", "transition": 49}, {"text": "Ignore it and explore on your own", "transition": 50}]},
            {"text": "The sign pointed toward a crooked path lined with glowing mushrooms.<br>They pulsed softly, lighting his way like tiny lanterns.<br>As Sam walked, he heard faint laughter behind him—childlike and echoing.<br>When he turned, there was no one there. Only his footprints in the glowing soil.<br>", "transitions": [{"text": "Call out", "transition": 51}, {"text": "Run ahead", "transition": 52}]},
            {"text": "Sam wandered off the trail, curious about a cluster of tall ferns.<br>The ground felt strangely soft beneath his feet—almost too soft.<br>Before he could react, it gave way!<br>He fell into a hidden pit lined with roots and moss.<br>", "transitions": [{"text": "Try to climb out", "transition": 53}, {"text": "Wait for help", "transition": 54}]},
            {"text": "“Who’s there?” Sam called, his voice trembling slightly.<br>The laughter stopped. Then came a whisper: “We remember you.”<br>A gust of wind blew out the mushrooms’ glow, leaving him in darkness.<br>Something brushed his shoulder—it felt like a feather. Then it was gone.<br>", "transitions": [{"text": "Light your flashlight", "transition": 55}, {"text": "Run back to the start", "transition": 56}]},
            {"text": "Sam sprinted ahead until the laughter faded.<br>He found a clearing filled with giant dandelions that sparkled like stars.<br>One puffed its seeds into the air—and suddenly he was surrounded by floating lights.<br>They formed words above his head: “Not all who wander are lost.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 22},
            {"text": "Sam grabbed a root and pulled, but it snapped, covering him in dirt.<br>Chipper appeared at the edge of the pit, eyes wide. “Hold on, I’ll get help!”<br>Sam tried to stay calm as roots shifted beneath him.<br>Then a voice below whispered, “Stay still, or they’ll wake.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 23},
            {"text": "Sam waited, breathing slowly. The pit was quiet except for the sound of dripping water.<br>He spotted tiny glowing eyes in the darkness.<br>When he blinked, they were gone—but the faint sound of digging grew louder.<br>Something was coming up from below.<br>", "transitions": [{"text": "Climb fast", "transition": 57}, {"text": "Stay still", "transition": 58}]},
            {"text": "Sam flicked on his flashlight, cutting through the shadows.<br>The light revealed dozens of old wooden faces carved into tree trunks around him.<br>Their mouths were open, and faint mist drifted out.<br>One tree whispered, “Take only memories, leave only footprints.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 24},
            {"text": "Sam turned and ran until the laughter was just an echo.<br>He burst from the trees, panting, and saw the edge of the forest at last.<br>Behind him, the mist closed like a door.<br>He never found that path again—but sometimes, at night, he heard laughter in the wind.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 25},
            {"text": "Sam clawed his way up, dirt crumbling under his fingers.<br>Just as something brushed his ankle, he grabbed Chipper’s paw and pulled free.<br>They collapsed on the grass, gasping and shaking.<br>The pit sealed itself, leaving no trace it had ever existed.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 26},
            {"text": "Sam froze. The digging stopped.<br>Then, slowly, a hand made of roots touched his shoe.<br>It wasn’t scary—it felt gentle, almost thankful.<br>When he blinked, he was lying in a field of yellow flowers, safe again.<br>", "transitions": [{"text": "Keep walking", "transition": 59}, {"text": "Fall back asleep", "transition": 66}]},
            {"text": "Later that day, Sam found an old cabin deep in the woods.<br>Smoke rose from the chimney, and the smell of berries filled the air.<br>He knocked, and a raspy voice said, “Come in, traveler.”<br>Inside, a woman with silver hair smiled. “You brought the forest’s light back.”<br>", "transitions": [{"text": "Stay for tea", "transition": 60}, {"text": "Run away", "transition": 61}]},
            {"text": "The tea was warm and tasted like honey and leaves.<br>The woman hummed softly, and the room shimmered like a dream.<br>“Tell me,” she said, “what did you learn today?”<br>Sam smiled. “That the forest is alive.” She nodded, pleased.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 27},
            {"text": "Sam bolted from the cabin, heart pounding.<br>When he looked back, there was no house—only trees swaying in the wind.<br>He stopped running and laughed nervously.<br>“Guess I’m imagining things,” he said. But in his pocket was a warm teacup.<br>", "transitions": [{"text": "Go walking with Chipper", "transition": 62}, {"text": "Go home", "transition": 48}]},
            {"text": "Night fell faster than Sam expected.<br>He realized he’d gone too far and couldn’t find the trail home.<br>Chipper pointed to a faint glow between the trees. “Maybe that way?”<br>They followed it and found a field of glowing mushrooms forming an arrow.<br>", "transitions": [{"text": "Follow the arrow", "transition": 63}, {"text": "Camp overnight", "transition": 64}]},
            {"text": "The arrow led to a small wooden bridge over a still pond.<br>Fireflies floated above the water, forming the shape of a heart.<br>Sam smiled. “I think the forest likes us.”<br>Chipper nodded. “Maybe it’s saying goodnight.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 28},
            {"text": "They built a tiny campfire with dry twigs.<br>The night was quiet except for the sound of owls and rustling leaves.<br>Sam looked up and saw a shooting star streak across the sky.<br>He made a wish—that he could always come back to this forest.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 29},
            {"text": "The next morning, Sam found a trail of paw prints beside the campfire.<br>They weren’t Chipper’s—these were large, round, and deep.<br>He followed them to a clearing and found a huge stone shaped like a sleeping bear.<br>The bear’s stone eyes opened, and it said, “You should not have followed.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 30},
            {"text": "Sam woke with the sunrise, the forest covered in dew.<br>He stretched, smiled, and watched Chipper chase butterflies.<br>A cool breeze rustled the trees as if whispering goodbye.<br>When he reached home, his mom said, “You were gone only an hour.”<br>But Sam knew better—the forest had its own time.<br>", "transitions": [{"text": "Next", "transition": 67}]},
            {"text": "Years later, when Sam was grown, he took his own children to the forest.<br>He showed them where the trees touched the sky and where Chipper once lived.<br>The forest greeted him quietly, a familiar hum in the wind.<br>And as he smiled, he could have sworn he heard a tiny squirrel giggle, “Welcome back.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 31},
            {"text": "Sam decided to go for a swim.<br>He finds a river and starts swimming. He closes his eyes and floats, but when he opens them again, he’s on the bank with no idea where home is.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 32}
        ],
        "endings": 32,
        "questions": [
            {"text": "Who was the main character?", "type": "multi", "options": ["Sam", "Chipper", "Aaron"], "correct": "Sam"},
            {"text": "What did Sam love to do?", "type": "multi", "options": ["Swim in the river", "Climb in the mountains", "Go for walks and explore"], "correct": "Go for walks and explore"},
            {"text": "Where did Sam go on his walk?", "type": "multi", "options": ["In a big city", "In a blue forest", "In a green forest"], "correct": "In a green forest"},
            {"text": "What were the names of the two creatures Sam met?", "type": "type", "size": "short", "correct": ["aaron", "chipper"]},
            {"text": "What did Aaron want to show Sam?", "type": "multi", "options": ["His home", "His bird friends", "A waterfall"], "correct": "His home"},
            {"text": "Would you rather explore with Chipper or Aaron? Explain.", "type": "type", "size": "long"}
        ]
    },
    {
        "name": "Kevin's School Day",
        "image": "img/kevinsSchoolDay/kevinImages.jpg",
        "cols": 20,
        "icon": "img/kevinsSchoolDay/icon.jpg",
        "story": [
            {"text": "Kevin did not like his alarm clock. He liked to sleep in his warm bed. Kevin knew he had to do the thing he liked the least. Go to school. He crawled out of his bed and decided to get changed.", "transitions": [{"text": "Kevin gets dressed in a clown costume", "transition": 2}, {"text": "Kevin stays in his pajamas", "transition": 3}, {"text": "Kevin gets dressed in a suit", "transition": 4}]},
            {"text": "Kevin dresses up in his clown costume. Now Kevin decides it’s time to go downstairs and say good morning to his parents. “Hi Mom, hi Dad!” says Kevin. “Hi Kevin,” they say, his Mom looks at him and says, “Kevin, you are not wearing that to school, go put on some real clothes.”", "transitions": [{"text": "Kevin gets dressed in his pajamas", "transition": 3}, {"text": "Kevin gets dressed in a suit", "transition": 4}]},
            {"text": "Kevin decides to wear his pajamas. Now Kevin decides it’s time to go downstairs and say good morning to his parents. “Hi Mom, hi Dad!” says Kevin. “Hi Kevin,” they say, “Go have some breakfast now,” his mom says.", "transitions": [{"text": "Kevin doesn’t have breakfast", "transition": 5}, {"text": "Kevin has cereal", "transition": 6}]},
            {"text": "Kevin decides to wear a suit. Now Kevin decides it’s time to go downstairs and say good morning to his parents. “Hi Mom, hi Dad!” says Kevin. “Hi Kevin,” they say, “You look so professional, little man, go have some breakfast now,” his mom says.", "transitions": [{"text": "Kevin doesn’t have breakfast", "transition": 5}, {"text": "Kevin has cereal", "transition": 6}]},
            {"text": "Kevin decides not to eat breakfast, and instead packs his bag and makes his bed. When he goes downstairs his parents stand at the door ready to drive him to school.", "transitions": [{"text": "Kevin chooses to go with his Mom", "transition": 9}, {"text": "Kevin chooses to go with his Dad", "transition": 10}, {"text": "Kevin chooses to walk to school", "transition": 11}]},
            {"text": "Kevin eats his cereal, then he brushes his teeth and rushes down the stairs. When he gets to the door, his parents are waiting for him.", "transitions": [{"text": "Kevin chooses to go with his Mom", "transition": 7}, {"text": "Kevin chooses to go with his Dad", "transition": 8}, {"text": "Kevin chooses to walk to school", "transition": 11}]},
            {"text": "Kevin hops into Mom’s car and we drive down the street on the way to school. Mom plays her music and Kevin looks out his window. He watches a ball slowly roll down the street.", "transitions": [{"text": "Get out and go get the ball", "transition": 12}, {"text": "Keep on driving and ignore it", "transition": 13}]},
            {"text": "Kevin climbs into the car with Dad. Dad tells so many funny jokes on the way that Kevin can’t think properly.", "transitions": [{"text": "Kevin keeps laughing", "transition": 14}, {"text": "Kevin tells his Dad to stop joking", "transition": 15}]},
            {"text": "Kevin decides to go with Mom, on the way to school, Kevin sees a cat stuck in a tree.", "transitions": [{"text": "Kevin asks his Mom to keep driving", "transition": 16}, {"text": "Kevin stops to help the cat", "transition": 17}]},
            {"text": "Kevin decides to go with Dad, Dad drops him off on the block so that he can go to work early.", "transitions": [{"text": "Kevin walks straight to school", "transition": 18}, {"text": "Kevin walks the long way to school", "transition": 19}]},
            {"text": "Kevin decides to walk to school, on the way to school he sees something shiny in the grass.", "transitions": [{"text": "Kevin decides to pick it up", "transition": 20}, {"text": "Kevin decides to walk by it", "transition": 21}]},
            {"text": "Kevin asks his Mom to pull over, he hops out, grabs the ball and rushes back to the car. In the car he throws the ball up and down. Then Kevin gets to the school and his Mom lets him out.", "transitions": [{"text": "Kevin leaves the ball in the car", "transition": 22}, {"text": "Kevin takes the ball to school", "transition": 23}]},
            {"text": "Kevin looks out the other window and continues to go to school.", "transitions": [{"text": "Kevin goes to school", "transition": 18}]},
            {"text": "Kevin laughs so hard that when he stumbles out of the car and his Dad drives away, he goes all the way to his classroom before he realizes that he forgot his bag in the car.", "transitions": [{"text": "Kevin goes the day without his bag", "transition": 24}, {"text": "Kevin runs after his dad’s car", "transition": 25}, {"text": "Kevin goes to the office and calls his dad", "transition": 26}]},
            {"text": "Kevin tells his dad to be quiet and play the radio. His dad silently turns on the radio and finishes the drive silently.", "transitions": [{"text": "Kevin apologies and tells his Dad to tell jokes", "transition": 14}, {"text": "Kevin says nothing", "transition": 18}]},
            {"text": "Kevin decides not to tell his Mom about the cat.", "transitions": [{"text": "Kevin doesn't tell his mom", "transition": 18}]},
            {"text": "Kevin asks his Mom to pull over so he can help the cat. Kevin climbs up the tree and gets the cat. Kevin is very hungry.", "transitions": [{"text": "Kevin got the cat!", "transition": 27}]},
            {"text": "Kevin decides to go straight to school. Kevin walks into his classroom. He sits at his desk.", "transitions": [{"text": "Kevin talks to the teacher", "transition": 28}, {"text": "Kevin talks to the person next to him", "transition": 29}, {"text": "Kevin hears a weird humming sound", "transition": 37}]},
            {"text": "Kevin walks around the school and walks into the forest.", "transitions": [{"text": "Kevin stays in the forest", "transition": 30}, {"text": "Kevin goes to school", "transition": 31}]},
            {"text": "Kevin walks over to it and finds a shiny coin.", "transitions": [{"text": "Kevin takes the coin", "transition": 32}, {"text": "Kevin leaves the coin", "transition": 33}]},
            {"text": "Kevin decides to walk past the shiny object.", "transitions": [{"text": "Kevin walks past", "transition": 18}]},
            {"text": "Kevin leaves the ball in the car he skips into the school.", "transitions": [{"text": "Kevin skips all the way to class", "transition": 34}, {"text": "Kevin walks to class", "transition": 18}]},
            {"text": "Kevin takes the ball into the school. He throws the ball up and down. When he’s in the building he throws it up and a massive hairy hand grabs the ball.", "transitions": [{"text": "Kevin screams and runs", "transition": 35}, {"text": "Kevin confronts the ball stealer", "transition": 36}]},
            {"text": "Kevin decides to not use his bag. He goes into class and the teacher asks him, “Kevin, where is your bag?” “It’s in my Dad’s car” “Go to the office and call your Dad now.”", "transitions": [{"text": "Call dad", "transition": 26}]},
            {"text": "Kevin races out of the building and runs after his Dad’s car. He runs and runs and runs but can’t catch up.", "transitions": [{"text": "Slow down!", "transition": 19}]},
            {"text": "Kevin walks into the office and asks to call his Dad. “Do you remember his number sweetheart,” the desk lady asked. You remember two numbers, but you forget which one is your Dad’s.", "transitions": [{"text": "You call 905-234-3748", "transition": 38}, {"text": "You call 905-235-0987", "transition": 39}]},
            {"text": "Kevin walks into class and sits at his desk. The person who sits next to him is at the front of the class talking with her friends. She left an apple on her desk and Kevin is very hungry.", "transitions": [{"text": "Kevin takes the apple", "transition": 40}, {"text": "Kevin leaves the apple", "transition": 41}]},
            {"text": "Kevin decides to talk to the teacher. “Good morning, Mrs. Appleton!” Kevin says. Mrs. Appleton smiles, “Good morning, Kevin. I see someone is ready to learn today!” Kevin feels proud and takes out his notebook.", "transitions": [{"text": "Kevin asks a question", "transition": 42}, {"text": "Kevin doodles in his notebook", "transition": 43}]},
            {"text": "Kevin talks to the person next to him. “Hi, I’m Kevin,” he says. The other student smiles and says, “I’m Mia. Want to see my magic trick?” Kevin nods eagerly.", "transitions": [{"text": "Kevin watches the magic trick", "transition": 44}, {"text": "Kevin ignores it and reads a book", "transition": 45}]},
            {"text": "Kevin stays in the forest. He finds a little stream and sees frogs hopping around. Kevin decides to build a tiny leaf boat for one of the frogs.", "transitions": [{"text": "Kevin sails the leaf boat", "transition": 46}, {"text": "Kevin chases the frogs", "transition": 47}]},
            {"text": "Kevin goes to school. He enters the building and bumps into the janitor, who is juggling mops. Kevin laughs and helps catch one of the mops.", "transitions": [{"text": "Catch a mop", "transition": 28}]},
            {"text": "Kevin takes the shiny coin. It feels heavier than it looks. Suddenly, it glows and Kevin hears a tiny voice say, “Thank you for freeing me!”", "transitions": [{"text": "Kevin follows the voice", "transition": 48}, {"text": "Kevin pockets the coin and goes to class", "transition": 49}]},
            {"text": "Kevin leaves the coin. He keeps walking and notices a funny-shaped cloud that looks like a dragon. Kevin smiles and skips to school.", "transitions": [{"text": "Look at the cloud", "transition": 28}]},
            {"text": "Kevin skips all the way to class. His friends notice his happy skip and start skipping too. Soon the whole hallway is full of skipping students!", "transitions": [{"text": "Kevin joins a game of tag", "transition": 50}, {"text": "Kevin goes straight to his desk", "transition": 28}]},
            {"text": "Kevin screams and runs. The massive hairy hand belongs to a friendly giant puppet operated by the school drama club. Kevin laughs and joins the puppet performance.", "transitions": [{"text": "Join the performance", "transition": 51}]},
            {"text": "Kevin confronts the ball stealer. It’s a mischievous raccoon wearing a tiny hat! Kevin decides to play fetch with the raccoon.", "transitions": [{"text": "Play fetch with the raccoon", "transition": 52}]},
            {"text":"Kevin notices the classroom window is open and hears a strange humming sound.<br>","transitions":[{"text":"Investigate the sound","transition":53},{"text":"Stay at the desk","transition":28}]},
            {"text":"Kevin calls his Dad at 905-234-3748.<br>Dad answers cheerfully and says, “Sorry, buddy! I’ll bring your bag to school.”<br>Kevin smiles and waits patiently.<br>","transitions":[{"text":"Wait patiently","transition":54}]},
            {"text":"Kevin calls his Dad at 905-235-0987.<br>Dad says, “I’m at work and can’t come!”<br>Kevin sighs but remembers he packed his lunch in a small backpack anyway.<br>","transitions":[{"text":"Remember your lunch","transition":55}]},
            {"text":"Kevin takes the apple from the desk.<br>It tastes delicious and gives him extra energy.<br>Kevin feels ready for any adventure!<br>","transitions":[{"text":"Kevin is ready!","transition":56}]},
            {"text":"Kevin leaves the apple.<br>He decides to wait until lunch to eat.<br>Meanwhile, his stomach rumbles quietly.<br>","transitions":[{"text":"Wait until lunch","transition":56}]},
            {"text":"Kevin asks a question in class.<br>Mrs. Appleton nods and says, “That’s a great question, Kevin!”<br>Kevin feels smart and confident.<br>","transitions":[{"text":"Good question!","transition":57}]},
            {"text":"Kevin doodles in his notebook.<br>He draws a funny version of himself wearing a superhero cape.<br>He giggles quietly at his drawing.<br>","transitions":[{"text":"Kevin looks at his drawing","transition":57}]},
            {"text":"Kevin watches Mia’s magic trick.<br>She makes a coin disappear and appear behind Kevin’s ear!<br>Kevin laughs and applauds her trick.<br>","transitions":[{"text":"Kevin applauds","transition":58}]},
            {"text":"Kevin reads a book.<br>It’s about a mischievous cat who sneaks into a library at night.<br>Kevin imagines himself sneaking around like that cat.<br>","transitions":[{"text":"Kevin uses his imagination","transition":58}]},
            {"text":"Kevin sails the leaf boat.<br>The frog hops in and rides it across the stream.<br>Kevin cheers for his new frog friend.<br>","transitions":[{"text":"Kevin cheers","transition":59}]},
            {"text":"Kevin chases the frogs.<br>He slips on a mossy rock and lands in the water with a splash!<br>He laughs and jumps back out, soaked but happy.<br>","transitions":[{"text":"Kevin fell in the water!","transition":59}]},
            {"text":"Kevin follows the voice.<br>He finds a tiny fairy trapped inside a coin-sized bubble.<br>Kevin carefully frees the fairy.<br>","transitions":[{"text":"THE END","transition":"end"}], "endId": 1},
            {"text":"Kevin pockets the coin and goes to class.<br>He notices it glinting in his bag every so often.<br>He wonders if it’s just a lucky coin or something more mysterious.<br>","transitions":[{"text":"Is it mysterious?","transition":57}]},
            {"text":"Kevin joins a game of tag.<br>He runs so fast that he accidentally slides across the gym floor like a superhero.<br>Everyone cheers, and Kevin feels like the fastest kid in school.<br>","transitions":[{"text":"Kevin is very fast","transition":60}]},
            {"text":"Kevin joins the puppet performance.<br>He pretends the giant puppet is his secret sidekick.<br>Everyone laughs and asks him to join the drama club.<br>","transitions":[{"text":"Kevin joins the club","transition":61}]},
            {"text":"Kevin plays fetch with the raccoon.<br>The raccoon steals a pencil and runs away.<br>Kevin chases it down, giggling, and ends up leading the raccoon through the playground.<br>","transitions":[{"text":"Kevin chases a raccoon","transition":62}]},
            {"text":"Kevin investigates the humming sound.<br>He discovers a hidden elevator that leads to a rooftop garden.<br>He sees the whole school from above.<br>","transitions":[{"text":"Explore the garden","transition":63},{"text":"Go downstairs","transition":28}]},
            {"text":"Kevin waits for Dad to bring the bag.<br>While waiting, he meets a friendly janitor who shows him a secret shortcut to the playground.<br>","transitions":[{"text":"A secret shortcut!","transition":64}]},
            {"text":"Kevin keeps his small backpack.<br>He decides to invent a “mini backpack survival kit” with pencils and snacks.<br>His classmates are impressed by his cleverness.<br>","transitions":[{"text":"Kevin is very clever","transition":65}]},
            {"text":"Kevin feels energized after (or before) lunch.<br>He decides to start a fun doodle contest with his classmates.<br>","transitions":[{"text":"Have a contest!","transition":66}]},
            {"text":"Kevin’s attention drifts during class.<br>He starts imagining himself as a superhero saving the school from mischievous aliens.<br>","transitions":[{"text":"Draw adventure","transition":67},{"text":"Daydream quietly","transition":68}]},
            {"text":"Kevin watches Mia’s trick or reads the book.<br>He learns a new way to imagine adventures and tells a friend about it.<br>","transitions":[{"text":"Tell a friend","transition":66}]},
            {"text":"Kevin’s frog adventure ends.<br>He decides he wants to bring a little nature project to class.<br>His classmates cheer when he shows them the leaf boat.<br>","transitions":[{"text":"Show the leaf boat","transition":66}]},
            {"text":"Kevin keeps playing tag.<br>He wins the game but trips and rolls into a pile of mats.<br>Everyone laughs, including Kevin, and he takes a bow.<br>","transitions":[{"text":"THE END","transition":"end"}], "endId": 2},
            {"text":"Kevin joins the drama club puppet performance.<br>He becomes “Puppet Kevin,” the star of the show.<br>They perform at the school assembly.<br>","transitions":[{"text":"THE END","transition":"end"}], "endId": 3},
            {"text":"Kevin chases the raccoon and retrieves his pencil.<br>The raccoon gives him a tiny bow as a “thank you gift” and runs off.<br>Kevin keeps the bow as a lucky charm.<br>","transitions":[{"text":"Keep the bow","transition":66}]},
            {"text":"Kevin explores the rooftop garden.<br>He finds a nest of baby birds chirping loudly.<br>He gently watches them and decides to tell the teacher about the garden.<br>","transitions":[{"text":"Tell the teacher","transition":69}]},
            {"text":"Kevin follows the janitor’s shortcut.<br>He discovers a tiny hidden playground slide.<br>He slides down with glee and almost bumps into his principal!<br>","transitions":[{"text":"Bump into the principal","transition":70}]},
            {"text":"Kevin shows off his mini backpack.<br>Other kids get inspired to create their own mini kits.<br>Kevin feels proud for being clever.<br>","transitions":[{"text":"THE END","transition":"end"}], "endId": 4},
            {"text":"Kevin starts a doodle contest.<br>Everyone joins in, creating funny monsters and superheroes.<br>The classroom turns into a colorful gallery.<br>","transitions":[{"text":"Monsters and superheroes?!","transition":71}]},
            {"text":"Kevin draws his superhero adventure.<br>He imagines saving the school from a giant cookie monster.<br>Everyone laughs when he shows them his comic.<br>","transitions":[{"text":"Everyone laughs","transition":71}]},
            {"text":"Kevin daydreams quietly.<br>He imagines winning a gold star for being the calmest kid in class.<br>He smiles to himself and returns to work.<br>","transitions":[{"text":"Return to work","transition":71}]},
            {"text":"Kevin tells the teacher about the rooftop garden.<br>The teacher congratulates him for discovering a new school hideout.<br>They plan a class visit to see it safely.<br>","transitions":[{"text":"THE END","transition":"end"}], "endId": 5},
            {"text":"Kevin slides down the hidden playground slide.<br>The principal laughs and asks him to help with a “fun obstacle course” event.<br>","transitions":[{"text":"Plan an obstacle course","transition":72}]},
            {"text":"Kevin’s doodle contest ends. The teacher praises everyone’s creativity and hangs the drawings on the wall.","transitions":[{"text":"THE END","transition":"end"}], "endId": 6},
            {"text":"Kevin helps set up the obstacle course with the principal.<br>He becomes the official “fun coordinator” for the day.<br>","transitions":[{"text":"The fun coordinator!","transition":73}]},
            {"text":"Kevin runs around helping students in the obstacle course. He accidentally wins a small prize for being the fastest helper.","transitions":[{"text":"THE END","transition":"end"}], "endId": 7},
            {"text":"Kevin accidentally drops his pencil in class. It rolls under the desk and reveals a hidden treasure map drawn by a past student.","transitions":[{"text":"Kevin follows the treasure map","transition":"75"},{"text":"Kevin ignores it","transition":"56"}]},
            {"text":"Kevin follows the treasure map during recess. He discovers a tiny box filled with stickers, erasers, and a note saying, “You are brave and clever!”","transitions":[{"text":"Tiny boxes are great","transition":"76"}]},
            {"text":"Kevin finishes looking at the treasure box of stickers and erasers. He wonders what else the school might hide.","transitions":[{"text":"Kevin explores the playground","transition":"77"},{"text":"Kevin goes back to class","transition":"78"}]},
            {"text":"Kevin sneaks out to the playground. He sees a small wooden door under the slide.","transitions":[{"text":"Kevin opens the door","transition":"79"},{"text":"Kevin ignores it and climbs the slide","transition":"80"}]},
            {"text":"Kevin goes back to class. His friends notice him looking curious.","transitions":[{"text":"Kevin tells them about the treasure box","transition":"81"},{"text":"Kevin keeps it a secret","transition":"82"}]},
            {"text":"Kevin opens the little door and finds a tiny hallway with glowing drawings on the walls.","transitions":[{"text":"Kevin follows the glowing drawings","transition":"83"},{"text":"Kevin goes back to the playground","transition":"77"}]},
            {"text":"Kevin climbs the slide and finds a rope swing. He swings high into the air and feels like flying.","transitions":[{"text":"Kevin jumps off safely","transition":"84"},{"text":"Kevin keeps swinging to see how high he can go","transition":"85"}]},
            {"text":"Kevin tells his friends about the stickers and erasers. They get excited and ask to see them.","transitions":[{"text":"Kevin shares the treasure","transition":"86"},{"text":"Kevin hides it again","transition":"82"}]},
            {"text":"Kevin keeps the treasure to himself. He feels a little sneaky but also proud.","transitions":[{"text":"Kevin looks for more hidden treasures","transition":"87"},{"text":"Kevin decides to focus on classwork","transition":"78"}]},
            {"text":"Kevin follows the glowing drawings and finds a tiny room filled with floating lanterns.","transitions":[{"text":"Kevin touches a lantern","transition":"88"},{"text":"Kevin just looks at them quietly","transition":"89"}]},
            {"text":"Kevin jumps off the swing and lands on a soft patch of grass. He feels brave.","transitions":[{"text":"Kevin explores the grassy area","transition":"90"},{"text":"Kevin runs back to the playground","transition":"77"}]},
            {"text":"Kevin keeps swinging higher and higher. Suddenly, he swings over a small sandbox he didn’t notice before.","transitions":[{"text":"Kevin jumps into the sandbox","transition":"91"},{"text":"Kevin swings back down safely","transition":"84"}]},
            {"text":"Kevin shares the treasure with his friends. They all cheer and decide to play a new game together.","transitions":[{"text":"Kevin starts a treasure hunt","transition":"92"},{"text":"Kevin plays tag with his friends","transition":"93"}]},
            {"text":"Kevin looks around the playground for more hidden treasures. He spots a small hole near the fence.","transitions":[{"text":"Kevin peers inside","transition":"94"},{"text":"Kevin ignores the hole","transition":"90"}]},
            {"text":"Kevin touches a floating lantern. It sparkles and lifts gently into the air. A tiny voice whispers, “Follow me!”","transitions":[{"text":"Kevin follows the lantern","transition":"95"},{"text":"Kevin lets it float away","transition":"89"}]},
            {"text":"Kevin just looks at the lanterns. They glow softly and fill the room with pretty colors.","transitions":[{"text":"Kevin picks up a lantern to take back to class","transition":"96"},{"text":"Kevin leaves the lanterns alone","transition":"97"}]},
            {"text":"Kevin explores the grassy area and discovers a small tunnel covered with leaves.","transitions":[{"text":"Kevin crawls into the tunnel","transition":"98"},{"text":"Kevin keeps walking around the playground","transition":"99"}]},
            {"text":"Kevin jumps into the sandbox and finds a buried toy dragon.","transitions":[{"text":"Kevin digs up the whole dragon","transition":"100"},{"text":"Kevin leaves it half-buried","transition":"101"}]},
            {"text":"Kevin starts a treasure hunt for his friends. They split into teams and giggle as they search.","transitions":[{"text":"Kevin hides another secret prize","transition":"102"},{"text":"Kevin just watches the hunt","transition":"103"}]},
            {"text":"Kevin plays tag with his friends. He runs so fast he trips over a mysterious rock.","transitions":[{"text":"Kevin looks under the rock","transition":"104"},{"text":"Kevin keeps playing tag","transition":"105"}]},
            {"text":"Kevin peers inside the hole and sees a small glowing key.","transitions":[{"text":"Kevin grabs the key","transition":"106"},{"text":"Kevin leaves it","transition":"90"}]},
            {"text":"Kevin follows the lantern and finds a tiny fairy garden tucked behind a bush.","transitions":[{"text":"Kevin talks to the fairies","transition":"107"},{"text":"Kevin just looks quietly","transition":"108"}]},
            {"text":"Kevin picks up a lantern and carries it to class. It glows in his bag, making everyone curious.","transitions":[{"text":"Kevin shows it to the teacher","transition":"109"},{"text":"Kevin keeps it secret","transition":"110"}]},
            {"text":"Kevin leaves the lanterns alone. The room slowly dims as he walks back to the playground.","transitions":[{"text":"Kevin explores more of the playground","transition":"77"},{"text":"Kevin goes back to class","transition":"78"}]},
            {"text":"Kevin crawls into the tunnel and finds a secret garden full of flowers and small animals.","transitions":[{"text":"Kevin follows a rabbit","transition":"111"},{"text":"Kevin just looks at the garden","transition":"112"}]},
            {"text":"Kevin keeps walking around the playground and discovers a tree with a rope ladder.","transitions":[{"text":"Kevin climbs the ladder","transition":"113"},{"text":"Kevin ignores it","transition":"77"}]},
            {"text":"Kevin digs up the whole dragon toy. It flaps its tiny wings and squeaks happily.","transitions":[{"text":"Kevin takes the dragon to class","transition":"114"},{"text":"Kevin leaves it in the sandbox","transition":"115"}]},
            {"text":"Kevin leaves the dragon half-buried. A tiny note is tucked under it: “Play with care!”","transitions":[{"text":"Kevin reads the note","transition":"116"},{"text":"Kevin ignores the note","transition":"115"}]},
            {"text":"Kevin hides another secret prize: a small shiny marble.","transitions":[{"text":"A friend finds it","transition":"117"},{"text":"No one finds it","transition":"118"}]},
            {"text":"Kevin just watches the hunt. He notices a hidden path behind the swings.","transitions":[{"text":"Kevin explores the path","transition":"119"},{"text":"Kevin stays with the friends","transition":"105"}]},
            {"text":"Kevin looks under the rock and finds a tiny map.","transitions":[{"text":"Kevin follows the map","transition":"120"},{"text":"Kevin keeps it in his pocket for later","transition":"121"}]},
            {"text":"Kevin keeps playing tag. He runs past a tree and finds a small door carved into the trunk.","transitions":[{"text":"Kevin opens the tree door","transition":"122"},{"text":"Kevin ignores it","transition":"93"}]},
            {"text":"Kevin grabs the glowing key. It feels warm in his hand.","transitions":[{"text":"Kevin searches for the lock it belongs to","transition":"123"},{"text":"Kevin puts it in his pocket for later","transition":"124"}]},
            {"text":"Kevin talks to the fairies. They giggle and give him a tiny crown.","transitions":[{"text":"THE END","transition":"end"}], "endId": 8},
            {"text":"Kevin just looks quietly. He sees the fairies dancing and waving.","transitions":[{"text":"Kevin joins the dance","transition":"125"},{"text":"Kevin leaves the garden","transition":"112"}]},
            {"text":"Kevin shows the lantern to the teacher. She smiles and says it’s a “magic classroom helper.”","transitions":[{"text":"Kevin lights the lantern during class","transition":"126"},{"text":"Kevin keeps it on his desk without lighting","transition":"127"}]},
            {"text":"Kevin keeps the lantern secret. He notices it glows softly when he writes in his notebook.","transitions":[{"text":"Kevin writes a secret message to the lantern","transition":"128"},{"text":"Kevin just watches it glow","transition":"129"}]},
            {"text":"Kevin follows the rabbit and finds a tiny door in a tree.","transitions":[{"text":"Kevin opens the door","transition":"130"},{"text":"Kevin follows the rabbit back to the garden","transition":"112"}]},
            {"text":"Kevin just looks at the garden. He sees butterflies and hears birds singing.","transitions":[{"text":"Kevin collects a flower to show his class","transition":"131"},{"text":"Kevin leaves the garden as it is","transition":"132"}]},
            {"text":"Kevin climbs the ladder and finds a treehouse full of old toys.","transitions":[{"text":"Kevin plays with the toys","transition":"133"},{"text":"Kevin explores the treehouse for secrets","transition":"134"}]},
            {"text":"Kevin takes the dragon to class. It flaps its tiny wings and makes the other kids laugh. Kevin’s dragon becomes the class mascot for the day.","transitions":[{"text":"THE END","transition":"end"}], "endId": 9},
            {"text":"Kevin leaves the dragon in the sandbox. He waves goodbye as he goes back to play.","transitions":[{"text":"Kevin continues exploring the playground","transition":"77"},{"text":"Kevin goes back to class","transition":"78"}]},
            {"text":"Kevin reads the note: “Play with care!” He smiles and decides to be careful with the dragon.","transitions":[{"text":"Kevin takes the dragon to class","transition":"114"},{"text":"Kevin leaves it","transition":"115"}]},
            {"text":"A friend finds the marble and thanks Kevin. They both giggle and hide it again.","transitions":[{"text":"Kevin starts a marble game","transition":"135"},{"text":"Kevin just watches","transition":"118"}]},
            {"text":"No one finds Kevin’s secret prize. He tucks it in his pocket and keeps exploring.","transitions":[{"text":"Kevin looks for more hidden treasures","transition":"87"},{"text":"Kevin goes back to class","transition":"78"}]},
            {"text":"Kevin explores the hidden path behind the swings and finds a small pond.","transitions":[{"text":"Kevin skips stones on the pond","transition":"136"},{"text":"Kevin looks into the pond for fish","transition":"137"}]},
            {"text":"Kevin follows the map and finds a tiny treasure chest buried under a tree root.","transitions":[{"text":"Kevin opens the chest","transition":"138"},{"text":"Kevin leaves it alone","transition":"139"}]},
            {"text":"Kevin keeps the map in his pocket for later. He wonders what adventure it could lead to.","transitions":[{"text":"Kevin goes back to play with friends","transition":"92"},{"text":"Kevin explores the playground alone","transition":"77"}]},
            {"text":"Kevin opens the tree door and finds a spiral staircase leading down.","transitions":[{"text":"Kevin goes down the staircase","transition":"140"},{"text":"Kevin goes back outside","transition":"105"}]},
            {"text":"Kevin searches for the lock the key belongs to and finds a tiny treasure box under a bench.","transitions":[{"text":"Kevin opens it","transition":"141"},{"text":"Kevin waits for later","transition":"124"}]},
            {"text":"Kevin puts the key in his pocket for later. He wonders if it will be useful soon.","transitions":[{"text":"Kevin looks for the lock","transition":"123"},{"text":"Kevin goes back to play","transition":"77"}]},
            {"text":"Kevin joins the fairy dance. The fairies twirl around him and sprinkle glowing dust. Kevin feels magical and dances all the way back to class.","transitions":[{"text":"THE END","transition":"end"}], "endId": 10},
            {"text":"Kevin lights the lantern during class. It glows softly, and everyone’s work looks brighter. Kevin’s class has a super fun, glowing day of learning.","transitions":[{"text":"THE END","transition":"end"}], "endId": 11},
            {"text":"Kevin keeps the lantern on his desk. He notices small shapes glowing inside it.","transitions":[{"text":"Kevin makes up a story about the shapes","transition":"142"},{"text":"Kevin ignores them","transition":"128"}]},
            {"text":"Kevin writes a secret message to the lantern. It sparkles and changes color as he writes.","transitions":[{"text":"Kevin shares the message with a friend","transition":"143"},{"text":"Kevin keeps it secret","transition":"144"}]},
            {"text":"Kevin watches the lantern glow quietly. He feels peaceful and happy.","transitions":[{"text":"Kevin draws the glowing shapes in his notebook","transition":"145"},{"text":"Kevin keeps staring at it","transition":"146"}]},
            {"text":"Kevin opens the tiny tree door and finds a spiral staircase.","transitions":[{"text":"Kevin climbs down the staircase","transition":"147"},{"text":"Kevin goes back outside","transition":"111"}]},
            {"text":"Kevin collects a flower to show his class. It smells sweet and brightens his bag. Kevin shares the flower with his teacher and feels proud.","transitions":[{"text":"THE END","transition":"end"}], "endId": 12},
            {"text":"Kevin leaves the garden as it is. He smiles and walks back to class.","transitions":[{"text":"Walk back to class","transition":"78"}]},
            {"text":"Kevin plays with the toys in the treehouse. He finds a toy rocket and imagines flying to space.","transitions":[{"text":"Kevin takes the rocket to class","transition":"148"},{"text":"Kevin leaves it in the treehouse","transition":"134"}]},
            {"text":"Kevin explores the treehouse for secrets and finds an old diary.","transitions":[{"text":"Kevin reads the diary","transition":"149"},{"text":"Kevin leaves it","transition":"134"}]},
            {"text":"Kevin starts a marble game with friends. They laugh and play for a long time. Kevin becomes the marble champion of the playground for the day.","transitions":[{"text":"THE END","transition":"end"}], "endId": 13},
            {"text":"Kevin skips stones on the pond. One stone skips five times and lands perfectly.","transitions":[{"text":"Kevin keeps skipping stones","transition":"150"},{"text":"Kevin explores the pond edge","transition":"151"}]},
            {"text":"Kevin looks into the pond and sees a tiny frog waving at him.","transitions":[{"text":"Kevin talks to the frog","transition":"152"},{"text":"Kevin ignores it and keeps walking","transition":"151"}]},
            {"text":"Kevin opens the tiny treasure chest. Inside is a sparkling gem. Kevin shows it to his friends and feels like a real treasure hunter.","transitions":[{"text":"THE END","transition":"end"}], "endId": 14},
            {"text":"Kevin leaves the chest alone. He wonders who hid it.","transitions":[{"text":"Who hid it?","transition":"90"}]},
            {"text":"Kevin goes down the spiral staircase and finds a glowing cave full of friendly fireflies.","transitions":[{"text":"Kevin chases the fireflies","transition":"153"},{"text":"Kevin watches them quietly","transition":"154"}]},
            {"text":"Kevin opens the treasure box under the bench. Inside is a tiny golden pencil. Kevin uses the golden pencil to draw magical pictures in class.","transitions":[{"text":"THE END","transition":"end"}], "endId": 15},
            {"text":"Kevin makes up a story about the glowing shapes in the lantern. Kevin shares his story with the class, and everyone claps.","transitions":[{"text":"THE END","transition":"end"}], "endId": 16},
            {"text":"Kevin shares the secret message with a friend. They giggle and make up more secret messages together. Kevin and his friend have a fun, sneaky adventure for the rest of the day.","transitions":[{"text":"THE END","transition":"end"}], "endId": 17},
            {"text":"Kevin keeps the secret message. He smiles quietly and writes more.","transitions":[{"text":"Write more","transition":"145"}]},
            {"text":"Kevin draws the glowing shapes in his notebook. His teacher notices and praises his creativity. Kevin feels proud for making such a beautiful drawing.","transitions":[{"text":"THE END","transition":"end"}], "endId": 18},
            {"text":"Kevin keeps staring at the lantern. It sparkles softly and makes him feel calm.","transitions":[{"text":"Feel calm","transition":"78"}]},
            {"text":"Kevin climbs down the staircase and finds a tiny underground library.","transitions":[{"text":"Kevin reads a book","transition":"155"},{"text":"Kevin explores the library for more secrets","transition":"156"}]},
            {"text":"Kevin takes the toy rocket to class. He pretends it’s real and flies around his desk. Kevin imagines an amazing space adventure with his classmates cheering.","transitions":[{"text":"THE END","transition":"end"}], "endId": 19},
            {"text":"Kevin reads the diary and finds stories about old school adventures.","transitions":[{"text":"Kevin writes his own adventure in the diary","transition":"157"},{"text":"Kevin just closes it","transition":"134"}]},
            {"text":"Kevin keeps skipping stones. He sees the reflection of the clouds in the pond.","transitions":[{"text":"Kevin draws the clouds in his notebook","transition":"158"},{"text":"Kevin keeps skipping stones","transition":"151"}]},
            {"text":"Kevin explores the pond edge and finds a small wooden boat.","transitions":[{"text":"Kevin sails the boat","transition":"159"},{"text":"Kevin leaves it","transition":"152"}]},
            {"text":"Kevin talks to the frog. The frog hops onto his hand and croaks a funny tune. Kevin makes a new animal friend for the day.","transitions":[{"text":"THE END","transition":"end"}], "endId": 20},
            {"text":"Kevin chases the fireflies. They lead him to a tiny door in the cave wall.","transitions":[{"text":"Kevin opens the door","transition":"160"},{"text":"Kevin ignores the door","transition":"154"}]},
            {"text":"Kevin watches the fireflies quietly. They light up the cave beautifully. Kevin feels peaceful and amazed by the glowing fireflies.","transitions":[{"text":"THE END","transition":"end"}], "endId": 21},
            {"text":"Kevin reads a book from the underground library. It tells a story about a secret school adventure.","transitions":[{"text":"Kevin acts out the story","transition":"161"},{"text":"Kevin just reads quietly","transition":"162"}]},
            {"text":"Kevin explores the underground library and finds a secret passage behind a bookshelf.","transitions":[{"text":"Kevin crawls through the passage","transition":"163"},{"text":"Kevin goes back upstairs","transition":"78"}]},
            {"text":"Kevin writes his own adventure in the diary about hidden treasures. Kevin imagines himself as a hero explorer every day in class.","transitions":[{"text":"THE END","transition":"end"}], "endId": 22},
            {"text":"Kevin draws the clouds from the pond in his notebook. They look magical on the page. Kevin feels proud of capturing a special moment from nature.","transitions":[{"text":"THE END","transition":"end"}], "endId": 23},
            {"text":"Kevin decides to go on the boat. He sails down the river and he lies down on the wood and takes a nap. When he opens his eyes again, he’s back at school!","transitions":[{"text":"THE END","transition":"end"}], "endId": 24},
            {"text":"Kevin opens the door, inside it is a bright white light. Kevin steps through it and on the other side is his classroom. His teacher walks and tells him it’s time to go home.","transitions":[{"text":"THE END","transition":"end"}], "endId": 25},
            {"text":"Kevin jumps around and acts out the story when he’s done he goes further and further into the underground library. Along the way he acts out more books. Eventually his teacher finds him and takes him back.","transitions":[{"text":"THE END","transition":"end"}], "endId": 26},
            {"text":"Kevin reads the book quietly. He keeps on reading books and goes further and further into the library. Kevin never finds his way back out.","transitions":[{"text":"THE END","transition":"end"}], "endId": 27},
            {"text":"Kevin crawls through the bookshelf and finds a tiny door.","transitions":[{"text":"Where does it go?", "transition":"79"}]}
        ],
        "endings": 27,
        "questions": [
            {"text": "What does Kevin like the least?", "type": "multi", "options": ["Homework", "School", "Walking"], "correct": "School"},
            {"text": "What does Kevin like?", "type": "multi", "options": ["His bed", "Wearing pajamas", "Driving"], "correct": "His bed"},
            {"text": "What does Kevin wake up in?", "type": "multi", "options": ["Pajamas", "A suit", "A clown costume"], "correct": "Pajamas"},
            {"text": "Would you wear a clown costume to school? Explain.", "type": "type", "size": "long"}
        ]
    }
]