[
    {
        "name": "Sam's Big Adventure",
        "image": "img/samsBigAdventure/sam.png",
        "icon": "img/samsBigAdventure/icon.jpg",
        "story": [
            {"text": "Sam loved to walk. He liked hearing the birds sing and feeling the wind on his face.<br>One sunny day, he walked so far that he found a big, green forest. The trees were so tall they tickled the clouds.<br>Suddenly, two little creatures appeared!<br>Chipper the squirrel waved his fluffy tail.<br>“Hi there! Follow me! I’ll teach you how to climb a tree!” he squeaked.<br>Aaron the groundhog popped out of a hole and said,<br>“Don’t climb trees! Come see my home underground. It’s warm and cozy!”<br>", "transitions": [{"text": "Go with Chipper", "transition": 2}, {"text": "Go with Aaron", "transition": 7}, {"text": "Go with Chipper and Aaron", "transition": 11}]},
            {"text": "Sam followed Chipper and started to climb the big oak tree.<br>“Hold on tight!” Chipper called. “Use your feet, not just your hands!”<br>When Sam reached the top, the forest spread out like a green ocean.<br>He could see his house far away!<br>“Look there!” said Chipper. “A bird’s nest! Do you want to peek inside?”<br>", "transitions": [{"text": "Look inside the nest", "transition": 3}, {"text": "Climb down", "transition": 6}]},
            {"text": "Sam crept closer and peeked into the nest.<br>Inside were three tiny, blue eggs. “They look like little sky marbles,” he whispered.<br>Then—whoosh!—a mama bird flew back!<br>“Chirp! Chirp!” she cried, flapping her wings.<br>", "transitions": [{"text": "Say sorry and climb down", "transition": 4}, {"text": "Try to talk to the bird", "transition": 5}]},
            {"text": "“I’m sorry, little bird,” Sam said softly.<br>The bird blinked and chirped again, but not angrily this time.<br>Chipper handed him a shiny acorn. “For being kind,” he said.<br>The moss beneath their feet glowed faintly as if approving his choice.<br>Sam realized he was really hot.<br>", "transitions": [{"text": "Go under a tree", "transition": 47}, {"text": "Go for a swim", "transition": 68}]},
            {"text": "“Hello,” Sam said. “I didn’t mean to scare you.”<br>The bird fluttered her wings and dropped a soft feather at his feet.<br>“Wow!” said Sam. “She gave me a gift!”<br>Sunlight danced on the feather, making rainbow patterns on the ground.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 1},
            {"text": "Sam shook his head. “I don’t want to bother the birds.”<br>“Good choice!” said Chipper. “Let’s find something yummy instead!”<br>They climbed down and shared berries from a bush.<br>", "transitions": [{"text": "Go home", "transition": "end"}, {"text": "Keep exploring", "transition": 23}, {"text": "It starts to rain", "transition": 45}], "endId": 2},
            {"text": "Sam decided to visit Aaron’s home.<br>Aaron led him through tall grass to a cave under a tree root.<br>Inside, it was warm and smelled like dirt and pine needles.<br>“I’ll grab some water,” said Aaron. “Make yourself comfy!”<br>Sam looked around at the tiny twig chairs.<br>Then he turned—and the door had closed!<br>", "transitions": [{"text": "Look for an exit", "transition": 8}, {"text": "Call for Aaron", "transition": 9}, {"text": "Wait", "transition": 10}]},
            {"text": "Sam ran his fingers along the wall and found a small tunnel.<br>", "transitions": [{"text": "Crawl through it", "transition": 43}, {"text": "Stay in the cave", "transition": 9}]},
            {"text": "Sam knocked on the door. “Aaron? Are you there?”<br>The door opened, and Aaron smiled. “Sorry! It got stuck.”<br>He handed Sam some cool water, and they laughed together.<br>The shadows in the cave seemed to retreat as laughter filled the room.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 3},
            {"text": "Sam sat down on a mossy rug.<br>He heard soft snoring—Aaron had fallen asleep!<br>Sam yawned and curled up, too.<br>Outside, the forest whispered gently, a lullaby of rustling leaves.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 4},
            {"text": "Sam followed Chipper and Aaron down a narrow trail that split into two tunnels.<br>The air was cool and smelled like pine needles.<br>One tunnel glowed with golden light, while the other was dark and echoed with dripping water.<br>Aaron twitched his nose. “The bright one leads to the heart of the forest.”<br>", "transitions": [{"text": "Take the bright tunnel", "transition": 12}, {"text": "Take the dark tunnel", "transition": 13}]},
            {"text": "The tunnel opened into a wide, sparkling chamber filled with roots that glowed like lanterns.<br>“Wow!” Sam whispered. “It’s beautiful!”<br>In the middle stood a small wooden box carved with forest symbols.<br>Chipper tilted his head. “Should we open it?”<br>", "transitions": [{"text": "Open the box", "transition": 14}, {"text": "Leave it alone", "transition": 15}]},
            {"text": "The dark tunnel grew colder and narrower.<br>Water dripped down the walls, and something small skittered ahead.<br>Sam crouched, shining his flashlight—two glowing eyes blinked back!<br>It was only a frog… or was it? The croak echoed like words: “Go back.”<br>", "transitions": [{"text": "Turn around", "transition": 16}, {"text": "Keep going", "transition": 17}]},
            {"text": "Sam slowly lifted the lid of the wooden box.<br>Inside was a single golden key resting on a bed of moss.<br>When he picked it up, the roots around them shimmered and pulsed.<br>Aaron whispered, “That’s the Forest Key. It opens paths meant to stay hidden.”<br>", "transitions": [{"text": "Use the key", "transition": 18}, {"text": "Pocket it and leave", "transition": 19}]},
            {"text": "Sam shook his head. “Let’s not touch it.”<br>Chipper nodded quickly. “Good idea. Forest boxes can be tricky.”<br>As they turned to leave, the lights in the roots dimmed one by one.<br>The tunnel behind them closed, sealing with soft earth.<br>They had no choice but to go deeper.<br>", "transitions": [{"text": "Go deeper", "transition": 20}]},
            {"text": "Sam turned around, heart pounding.<br>The tunnel walls seemed closer now, whispering softly in the dark.<br>When he finally crawled out, sunlight felt like a miracle.<br>Aaron laughed. “Guess that tunnel didn’t like visitors!”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 5},
            {"text": "Sam kept crawling until the tunnel opened into a crystal cave.<br>Glittering gems reflected his flashlight, painting the walls in rainbow colors.<br>He touched one—and it sang!<br>A low, humming note filled the air, and suddenly the cave trembled.<br>", "transitions": [{"text": "Run!", "transition": 21}, {"text": "Stay to listen", "transition": 22}]},
            {"text": "Sam placed the key against a nearby root, and a door appeared!<br>Warm light spilled out, and a faint melody drifted through.<br>He stepped inside and found a treehouse filled with glowing books.<br>Each page whispered stories of forest adventures long forgotten.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 6},
            {"text": "Sam tucked the key into his pocket and smiled.<br>“I’ll save it for later,” he said.<br>As they left the chamber, the light behind them flickered, and the forest seemed to sigh.<br>Something told him the forest would remember him now.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 7},
            {"text": "The tunnel sloped downward until it opened into a moonlit cavern.<br>A pool of water shimmered in the center, glowing softly.<br>Chipper dipped his paw in and gasped. “It’s warm!”<br>Sam smiled. “A secret spring.” They sat beside it, resting as the forest sang above.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 8},
            {"text": "Sam ran as the crystal cave shook violently.<br>Rocks tumbled down, but he dove through the exit just in time.<br>Behind him, the entrance collapsed, sealing the strange song forever.<br>Aaron popped out of the ground nearby. “You made it!” he said, grinning.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 9},
            {"text": "Sam listened, mesmerized, as the humming turned gentle and calm.<br>The gems around him began to glow like a thousand stars.<br>When the song ended, he felt light and peaceful, as if he’d dreamed while awake.<br>He whispered, “Thank you,” and the cave whispered back, “Come again.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 10},
            {"text": "Sam and Chipper walked deeper into the forest, where the air grew cooler and damp.<br>A fog rolled in, wrapping around their ankles like soft blankets.<br>From somewhere ahead came a low humming, like bees—but slower, almost musical.<br>Chipper tilted his head. “That’s not normal forest sound…” he whispered.<br>", "transitions": [{"text": "Follow the humming", "transition": 24}, {"text": "Climb a tree to look around", "transition": 25}, {"text": "Run and go home", "transition": 44}]},
            {"text": "The humming grew louder until Sam could make out glowing blue lights floating between the trees.<br>They weren’t bugs—each one looked like a tiny ball of mist.<br>When Sam reached out to touch one, it darted away, giggling faintly.<br>Suddenly, one floated close and whispered, “Stay with us forever.”<br>", "transitions": [{"text": "Run!", "transition": 26}, {"text": "Stay to talk", "transition": 27}]},
            {"text": "Sam climbed a tall pine tree, the bark rough under his hands.<br>From above, he could see the mist forming shapes—faces that smiled and vanished.<br>In the distance, something sparkled near a pond.<br>Chipper called up, “I think I found something shiny!”<br>", "transitions": [{"text": "Climb down", "transition": 28}, {"text": "Stay to watch the mist", "transition": 29}]},
            {"text": "Sam turned and ran, heart pounding.<br>The blue lights followed him, whispering softly, “Don’t leave…”<br>He dove into a bush and covered his mouth, trying not to breathe too loud.<br>When he peeked out, the forest was quiet again—but he never forgot those voices.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 11},
            {"text": "Sam hesitated. “Who are you?” he asked.<br>The lights hovered closer, forming the shape of a tall, ghostly figure.<br>It smiled, gently touching his shoulder. “The forest remembers all who wander too deep.”<br>Chipper squeaked in terror and tugged Sam’s sleeve. They ran until the light faded.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 12},
            {"text": "Sam climbed down quickly and joined Chipper by the pond.<br>A beautiful golden ring lay half-buried in the mud.<br>When Sam picked it up, it shimmered and hummed softly.<br>“Maybe it’s magic,” said Chipper. “Or maybe it’s cursed.”<br>", "transitions": [{"text": "Put it on", "transition": 30}, {"text": "Throw it back", "transition": 31}]},
            {"text": "Sam stared at the mist as it twisted into patterns of stars and trees.<br>It whispered stories of lost travelers and old magic hidden in the soil.<br>He felt calm but strangely sleepy, his eyelids growing heavy.<br>When he woke, the mist and Chipper were gone—and the forest was silent.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 13},
            {"text": "Sam slipped the ring onto his finger.<br>At once, he felt lighter—like he could almost float.<br>Chipper’s eyes widened. “Sam! You’re glowing!”<br>Sam rose slowly into the air, laughing, as the forest shimmered with color.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 14},
            {"text": "Sam tossed the ring back into the pond.<br>The water rippled once, then went completely still.<br>“Smart,” said Chipper. “Magic things always come with trouble.”<br>They walked away, feeling proud and safe.<br>", "transitions": [{"text": "Keep walking", "transition": 32}]},
            {"text": "As the sun began to set, Sam and Chipper spotted an old bridge over a deep ravine.<br>It creaked with every gust of wind, and one of the ropes looked frayed.<br>“Should we cross?” asked Chipper.<br>Sam bit his lip. The shadows beneath looked endless.<br>", "transitions": [{"text": "Cross the bridge", "transition": 33}, {"text": "Search for another way", "transition": 35}]},
            {"text": "The bridge groaned under their feet.<br>Halfway across, a plank snapped, and Sam grabbed the rope to steady himself.<br>Chipper squeaked, “Don’t look down!”<br>Below, something moved—a long, dark shape swimming in the mist.<br>", "transitions": [{"text": "Rush forward", "transition": 34}, {"text": "Go back", "transition": 36}]},
            {"text": "Sam ran as fast as he could, the bridge swaying dangerously.<br>With a final leap, he made it to the other side.<br>The dark shape below rose up—a shadowy bird that screamed and vanished into the sky.<br>Chipper clapped his tiny paws. “You did it!”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 15},
            {"text": "Sam searched along the ravine and found a fallen tree forming a natural bridge.<br>It was sturdier, though mossy and slick.<br>They crossed carefully and reached a meadow filled with fireflies.<br>The moment they stepped in, all the fireflies spelled out his name.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 16},
            {"text": "Sam turned back, but the moment he stepped off the bridge, the rope snapped.<br>The bridge fell into the ravine with a thunderous crash.<br>He gasped, realizing how close he’d been to falling.<br>Chipper sighed in relief. “Guess we got lucky!”<br>", "transitions": [{"text": "Keep exploring", "transition": 37}, {"text": "Go home", "transition": 40}]},
            {"text": "After their close call, Sam noticed a trail lined with silver stones.<br>They glowed faintly under the twilight sky, leading deeper into the woods.<br>“Looks like someone left these here,” said Chipper.<br>", "transitions": [{"text": "Follow the stones", "transition": 38}, {"text": "Head home", "transition": 40}]},
            {"text": "The stones led them to a giant oak tree with a door carved into it.<br>Symbols glowed faintly on the bark, pulsing softly.<br>Chipper touched one, and the door creaked open.<br>Warm light spilled out, revealing shelves of glowing jars.<br>", "transitions": [{"text": "Enter", "transition": 39}, {"text": "Run!", "transition": 41}]},
            {"text": "Inside the oak, hundreds of tiny lights floated in jars.<br>Each one flickered like a memory—some happy, some sad.<br>An old voice said, “Each light is a wish from a traveler.”<br>Sam placed a finger on one jar, and it glowed brighter.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 17},
            {"text": "Sam decided to head home, his adventure enough for one day.<br>The forest seemed to sigh softly as he left.<br>When he turned back once, the path behind him was gone.<br>He smiled anyway, knowing he’d found something special.<br>", "transitions": [{"text": "Don't return", "transition": 67}, {"text": "Go back tomorrow to look for Chipper", "transition": 65}, {"text": "Go back at night", "transition": 42}]},
            {"text": "Sam turned to run, but the forest around him shifted.<br>The door in the oak vanished, replaced by twisting roots.<br>Chipper grabbed his arm. “We have to move!”<br>They ran until dawn, never looking back.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 18},
            {"text": "The next day, Sam returned to the forest with a lantern.<br>He wanted to see if the glowing stones were still there.<br>But when he reached the clearing, the ground was smooth and untouched.<br>Only a single silver pebble remained, shaped like a tiny heart.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 19},
            {"text": "Sam squeezed out of the cave into a field of mushrooms that hummed when the wind blew.<br>Each one emitted a soft note, creating strange music.<br>Sam smiled, tapping a rhythm with his finger.<br>The forest seemed to sing with them.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 20},
            {"text": "Sam tripped over a vine that slithered like a snake.<br>Before he could move, it wrapped around his ankle!<br>He pulled hard, breaking free and falling into soft moss.<br>When he looked back, the vine was still, as if pretending to be normal again.<br>", "transitions": [{"text": "Go home", "transition": 40}, {"text": "Keep walking", "transition": 59}]},
            {"text": "A light rain began to fall, making everything sparkle.<br>Sam laughed and danced while Chipper hid under a leaf.<br>“Come on!” Sam giggled. “It’s just water!”<br>A rainbow curved across the trees, ending somewhere deep in the forest.<br>", "transitions": [{"text": "Follow the rainbow", "transition": 46}, {"text": "Hide under a tree", "transition": 47}]},
            {"text": "The rainbow seemed to point toward something glowing faintly in the distance.<br>“Should we follow it?” asked Chipper.<br>Sam grinned. “Of course.”<br>Together they ran toward it, vanishing into a shimmer of colors.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 21},
            {"text": "Sam runs under a tree.<br>He finds an abandoned birdhouse swaying from a branch.<br>He peeked inside and found a folded note.<br>It read, “The forest sees kindness.”<br>He smiled and tucked it into his pocket.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 22},
            {"text": "The next morning, Sam returned to the forest.<br>A soft mist drifted between the trees, and birds called faintly in the distance.<br>He noticed a small wooden sign that hadn’t been there before.<br>It read: “Welcome Back, Sam.”<br>", "transitions": [{"text": "Follow the sign's direction", "transition": 49}, {"text": "Ignore it and explore alone", "transition": 50}]},
            {"text": "The sign pointed toward a crooked path lined with glowing mushrooms.<br>They pulsed softly, lighting his way like tiny lanterns.<br>As Sam walked, he heard faint laughter behind him—childlike and echoing.<br>When he turned, there was no one there. Only his footprints in the glowing soil.<br>", "transitions": [{"text": "Call out", "transition": 51}, {"text": "Run ahead", "transition": 52}]},
            {"text": "Sam wandered off the trail, curious about a cluster of tall ferns.<br>The ground felt strangely soft beneath his feet—almost too soft.<br>Before he could react, it gave way!<br>He fell into a hidden pit lined with roots and moss.<br>", "transitions": [{"text": "Climb out", "transition": 53}, {"text": "Wait for help", "transition": 54}]},
            {"text": "“Who’s there?” Sam called, his voice trembling slightly.<br>The laughter stopped. Then came a whisper: “We remember you.”<br>A gust of wind blew out the mushrooms’ glow, leaving him in darkness.<br>Something brushed his shoulder—it felt like a feather. Then it was gone.<br>", "transitions": [{"text": "Light your flashlight", "transition": 55}, {"text": "Run back to the start", "transition": 56}]},
            {"text": "Sam sprinted ahead until the laughter faded.<br>He found a clearing filled with giant dandelions that sparkled like stars.<br>One puffed its seeds into the air—and suddenly he was surrounded by floating lights.<br>They formed words above his head: “Not all who wander are lost.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 23},
            {"text": "Sam grabbed a root and pulled, but it snapped, covering him in dirt.<br>Chipper appeared at the edge of the pit, eyes wide. “Hold on, I’ll get help!”<br>Sam tried to stay calm as roots shifted beneath him.<br>Then a voice below whispered, “Stay still, or they’ll wake.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 24},
            {"text": "Sam waited, breathing slowly. The pit was quiet except for the sound of dripping water.<br>He spotted tiny glowing eyes in the darkness.<br>When he blinked, they were gone—but the faint sound of digging grew louder.<br>Something was coming up from below.<br>", "transitions": [{"text": "Climb fast", "transition": 57}, {"text": "Stay still", "transition": 58}]},
            {"text": "Sam flicked on his flashlight, cutting through the shadows.<br>The light revealed dozens of old wooden faces carved into tree trunks around him.<br>Their mouths were open, and faint mist drifted out.<br>One tree whispered, “Take only memories, leave only footprints.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 25},
            {"text": "Sam turned and ran until the laughter was just an echo.<br>He burst from the trees, panting, and saw the edge of the forest at last.<br>Behind him, the mist closed like a door.<br>He never found that path again—but sometimes, at night, he heard laughter in the wind.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 26},
            {"text": "Sam clawed his way up, dirt crumbling under his fingers.<br>Just as something brushed his ankle, he grabbed Chipper’s paw and pulled free.<br>They collapsed on the grass, gasping and shaking.<br>The pit sealed itself, leaving no trace it had ever existed.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 27},
            {"text": "Sam froze. The digging stopped.<br>Then, slowly, a hand made of roots touched his shoe.<br>It wasn’t scary—it felt gentle, almost thankful.<br>When he blinked, he was lying in a field of yellow flowers, safe again.<br>", "transitions": [{"text": "Keep walking", "transition": 59}, {"text": "Fall back asleep", "transition": 66}]},
            {"text": "Later that day, Sam found an old cabin deep in the woods.<br>Smoke rose from the chimney, and the smell of berries filled the air.<br>He knocked, and a raspy voice said, “Come in, traveler.”<br>Inside, a woman with silver hair smiled. “You brought the forest’s light back.”<br>", "transitions": [{"text": "Stay for tea", "transition": 60}, {"text": "Run!", "transition": 61}]},
            {"text": "The tea was warm and tasted like honey and leaves.<br>The woman hummed softly, and the room shimmered like a dream.<br>“Tell me,” she said, “what did you learn today?”<br>Sam smiled. “That the forest is alive.” She nodded, pleased.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 28},
            {"text": "Sam bolted from the cabin, heart pounding.<br>When he looked back, there was no house—only trees swaying in the wind.<br>He stopped running and laughed nervously.<br>“Guess I’m imagining things,” he said. But in his pocket was a warm teacup.<br>", "transitions": [{"text": "Go walking with Chipper", "transition": 62}, {"text": "Go home", "transition": 40}]},
            {"text": "Night fell faster than Sam expected.<br>He realized he’d gone too far and couldn’t find the trail home.<br>Chipper pointed to a faint glow between the trees. “Maybe that way?”<br>They followed it and found a field of glowing mushrooms forming an arrow.<br>", "transitions": [{"text": "Follow it", "transition": 63}, {"text": "Camp overnight", "transition": 64}]},
            {"text": "The arrow led to a small wooden bridge over a still pond.<br>Fireflies floated above the water, forming the shape of a heart.<br>Sam smiled. “I think the forest likes us.”<br>Chipper nodded. “Maybe it’s saying goodnight.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 29},
            {"text": "They built a tiny campfire with dry twigs.<br>The night was quiet except for the sound of owls and rustling leaves.<br>Sam looked up and saw a shooting star streak across the sky.<br>He made a wish—that he could always come back to this forest.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 30},
            {"text": "The next morning, Sam found a trail of paw prints beside the campfire.<br>They weren’t Chipper’s—these were large, round, and deep.<br>He followed them to a clearing and found a huge stone shaped like a sleeping bear.<br>The bear’s stone eyes opened, and it said, “You should not have followed.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 31},
            {"text": "Sam woke with the sunrise, the forest covered in dew.<br>He stretched, smiled, and watched Chipper chase butterflies.<br>A cool breeze rustled the trees as if whispering goodbye.<br>When he reached home, his mom said, “You were gone only an hour.”<br>But Sam knew better—the forest had its own time.<br>", "transitions": [{"text": "Years later", "transition": 67}]},
            {"text": "Years later, when Sam was grown, he took his own children to the forest.<br>He showed them where the trees touched the sky and where Chipper once lived.<br>The forest greeted him quietly, a familiar hum in the wind.<br>And as he smiled, he could have sworn he heard a tiny squirrel giggle, “Welcome back.”<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 32},
            {"text": "Sam decided to go for a swim.<br>He finds a river and starts swimming. He closes his eyes and floats, but when he opens them again, he’s on the bank with no idea where home is.<br>", "transitions": [{"text": "THE END", "transition": "end"}], "endId": 33}
        ],
        "endings": 33
    }
]